Goodjamp/nrf52840Mouse_SDK15/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hids_mouse/main.c
            uint8_t cnt = 0;
            for(; cnt < advDirOrdConnState.m_whitelist_peer_cnt; cnt++)
            {
                if(advDirOrdConnState.m_whitelist_peers[cnt] == peerId)
                {
                    break;
                }
            }
            if(cnt < advDirOrdConnState.m_whitelist_peer_cnt)
            {
                DEBUG_LOG("remove dev %d", advDirOrdConnState.m_whitelist_peers[cnt] );
                for(; cnt < (advDirOrdConnState.m_whitelist_peer_cnt - 1); cnt++)
                {
                    advDirOrdConnState.m_whitelist_peers[cnt] = advDirOrdConnState.m_whitelist_peers[cnt+1];//
                }
                advDirOrdConnState.m_whitelist_peer_cnt--;
                advDirOrdConnState.m_whitelist_peers[cnt] = PM_PEER_ID_INVALID;
                DEBUG_LOG("PDL quan %d", advDirOrdConnState.m_whitelist_peer_cnt);

                err_code = pm_whitelist_set((advDirOrdConnState.m_whitelist_peer_cnt == 0 ) ? (NULL) : (advDirOrdConnState.m_whitelist_peers),
                                       (advDirOrdConnState.m_whitelist_peer_cnt == 0 ) ? (0)    : (advDirOrdConnState.m_whitelist_peer_cnt));
                APP_ERROR_CHECK(err_code);
                // Setup the device identies list.
                // Some SoftDevices do not support this feature.
                err_code = pm_device_identities_list_set((advDirOrdConnState.m_whitelist_peer_cnt == 0 ) ? (NULL) : (advDirOrdConnState.m_whitelist_peers),
                                                    (advDirOrdConnState.m_whitelist_peer_cnt == 0 ) ? (0)    : (advDirOrdConnState.m_whitelist_peer_cnt));
                APP_ERROR_CHECK(err_code);
            }
            //disconnect current device
            appDisconnect();
            DEBUG_LOG("--------Dev in list ? %d", peerId);
            if(orderGetPos(deviceOrder, peerId, &pos))
            {
                DEBUG_LOG("Dev find %d  %d ", peerId, pos);
                if(advDirOrdConnState.listDetectedDev[pos] == DETECTED_DEV_FREE)
                {
                    USER_INFO("Device find, peer = %d", peerId);
                    advDirOrdConnState.listDetectedDev[pos] = peerId;
                    advDirOrdConnState.quantityDetectedDev++;
                }
            }
            if(advDirOrdConnState.quantityDetectedDev >= orderGetQuantity(deviceOrder))
            {
                USER_INFO("Total scan time (ms) = %d", getTime() - scaningTimeout);
                appAdvStop();
            }
        }
        break;
        case DEV_CONNECTION:// DO NOTHING (continue connection processing)
            /*DISCONNECT CURRENT DEVICE IF IT PEER ID DON'T EQUAL CURRENT DEVICE FROM WHITE LIST !!!! */
            DEBUG_LOG("_CONNECTION_");
            USER_INFO("Device connected, peer = %d", peerId);
            appAdvStop();
            break;
        }
        break;
    case ADV_EVT_STOP_ADV:
        DEBUG_LOG("STOP_ADV");
        switch(advDirOrdConnState.phase)
        {
        case DEV_SCANNING: // stop adv for previous phase and start connection to detected devices
        {
            uint8_t cnt_1 = 0;
            uint8_t cnt_2 = 0;
            DEBUG_LOG("_SCANNING_");
            USER_INFO("Stop scanning ");
            USER_INFO("Find devices %d", advDirOrdConnState.quantityDetectedDev);
            // if device wasn't detected  start adv again
            if(advDirOrdConnState.quantityDetectedDev == 0)
            {
                appAdvRun(ADV_RECONNECT_SCAN , 0);
                break;
            }
            // shift all devices on list UP
            for(cnt_1 = 0; cnt_1 < BLE_GAP_WHITELIST_ADDR_MAX_COUNT - 1; cnt_1++)
            {
                for(cnt_2 = BLE_GAP_WHITELIST_ADDR_MAX_COUNT-1; cnt_2 > 0; cnt_2--)
                {
                    if(advDirOrdConnState.listDetectedDev[cnt_2 - 1] == DETECTED_DEV_FREE &&
                            advDirOrdConnState.listDetectedDev[cnt_2 ]    != DETECTED_DEV_FREE)
                    {
                        advDirOrdConnState.listDetectedDev[cnt_2 - 1] = advDirOrdConnState.listDetectedDev[cnt_2 ];
                        advDirOrdConnState.listDetectedDev[cnt_2 ]    = DETECTED_DEV_FREE;
                    }
                }
            }
            advDirOrdConnState.connectCnt = 0;
            DEBUG_LOG("+++++++++");
            appAdvRun(ADV_RECONNECT_CONNECT , advDirOrdConnState.listDetectedDev[advDirOrdConnState.connectCnt]);
            DEBUG_LOG("---------");
            advDirOrdConnState.phase = DEV_CONNECTION;
        }
        break;
        case DEV_CONNECTION:   /*
            on this point I can go in two cases:
            - current device from WL was not able connect
            - LAST DEVICE THAT WAS IN CONNECT-> DISACONNECT STATE BEFOR STOP SCANNIN WAS DISCONNECTED
            */
            DEBUG_LOG("_CONNECTION_");
            if(advDirOrdConnState.connectCnt >= advDirOrdConnState.quantityDetectedDev)
            {

                advDirOrdConnState.loopCnt++;

                if(advDirOrdConnState.loopCnt >= DIRECT_CONN_QUANTITY)
                {
                    // start general advertising
                    break;
                }
                // start scanning again
                appUpdateBLEListPeers();
                memset(advDirOrdConnState.listDetectedDev, DETECTED_DEV_FREE, sizeof(advDirOrdConnState.listDetectedDev));
                advDirOrdConnState.connectCnt = 0;
                advDirOrdConnState.phase      = DEV_SCANNING;
                appAdvRun(ADV_RECONNECT_SCAN, 0);
            }
            // shift to next detected device
            advDirOrdConnState.connectCnt++;
            appAdvRun(ADV_RECONNECT_CONNECT, advDirOrdConnState.listDetectedDev[advDirOrdConnState.connectCnt]);
            break;
        }
        break;
    default:
        break;
    }
}


void appAdvProcessing(nrfBLEAdvEvT inEv, pm_peer_id_t peerId)
{
    switch(appState.currentAdvType)
    {
    case ADV_IDLE:
        appAdvIdleProc(inEv, peerId);
        break;
    case ADV_ADD_NEW:
        DEBUG_LOG("ADV_ADD_NEW");
        appAdvAddNewProc(inEv, peerId);
        break;
    case ADV_RECONNECT_SCAN:
        DEBUG_LOG("ADV_SCAN");
        appAdvDirectProc(inEv, peerId);
        break;
    case ADV_RECONNECT_CONNECT:
        DEBUG_LOG("ADV_CONNECT");
        appAdvDirectProc(inEv, peerId);
        break;
    }
}


void appAdvScanStopCB(void)
{
    DEBUG_LOG("Stop Scan");
    appAdvStop();
    appAdvProcessing(ADV_EVT_STOP_ADV, 0);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

