Goodjamp/nrf52840Mouse_SDK15/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hids_mouse/main.c
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    //advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();

    // is device on order the same as on flash:
    if(orderGetQuantity(deviceOrder) != appGetQuantityBLEPeers())
    {
        USER_INFO("Quantity items on order and flash don't equal, clear all");
        orderClean(deviceOrder);
        orderWriteFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));
        if(appGetQuantityBLEPeers() != 0)
        {
            delete_bonds();
        }
    }

    // Start execution.
    timers_start();
    //advertising_start(erase_bonds);
	advertising_init(APP_ADV_GLOBAL_INTERVAL, APP_ADV_GLOBAL_TIMEOUT, true);
    appAdvRun(ADV_RECONNECT_SCAN, 0);


    // Enter main loop.
    for (;;)
    {
        idle_state_handle();

		/******app processing*****************/
        appProcessing();
        userProcessingTimerCallbackFun();
        /*************************************/
    }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    switch(p_ble_evt->header.evt_id)
    {
         case BLE_GAP_EVT_CONNECTED:                  DEBUG_LOG("CONNECTED");                  break;
         case BLE_GAP_EVT_DISCONNECTED:               DEBUG_LOG("DISCONNECTED");               break;
         case BLE_GAP_EVT_CONN_PARAM_UPDATE:          DEBUG_LOG("CONN_PARAM_UPDATE");          break;
         case BLE_GAP_EVT_SEC_PARAMS_REQUEST:         DEBUG_LOG("SEC_PARAMS_REQUEST");         break;
         case BLE_GAP_EVT_SEC_INFO_REQUEST:           DEBUG_LOG("SEC_INFO_REQUEST");           break;
         case BLE_GAP_EVT_PASSKEY_DISPLAY:            DEBUG_LOG("PASSKEY_DISPLAY");            break;
         case BLE_GAP_EVT_KEY_PRESSED:                DEBUG_LOG("KEY_PRESSED");                break;
         case BLE_GAP_EVT_AUTH_KEY_REQUEST:           DEBUG_LOG("AUTH_KEY_REQUEST");           break;
         case BLE_GAP_EVT_LESC_DHKEY_REQUEST:         DEBUG_LOG("LESC_DHKEY_REQUEST");         break;
         case BLE_GAP_EVT_AUTH_STATUS:                DEBUG_LOG("AUTH_STATUS");                break;
         case BLE_GAP_EVT_CONN_SEC_UPDATE:            DEBUG_LOG("CONN_SEC_UPDATE");            break;
         case BLE_GAP_EVT_TIMEOUT:                    DEBUG_LOG("TIMEOUT");                    break;
         case BLE_GAP_EVT_RSSI_CHANGED:               DEBUG_LOG("RSSI_CHANGED");               break;
         case BLE_GAP_EVT_ADV_REPORT:                 DEBUG_LOG("ADV_REPORT");                 break;
         case BLE_GAP_EVT_SEC_REQUEST:                DEBUG_LOG("SEC_REQUEST");                break;
         case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:  DEBUG_LOG("CONN_PARAM_UPDATE_REQUEST");  break;
         case BLE_GAP_EVT_SCAN_REQ_REPORT:            DEBUG_LOG("SCAN_REQ_REPORT");            break;
         case BLE_GAP_EVT_PHY_UPDATE:                 DEBUG_LOG("PHY_UPDATE");                 break;
         case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: DEBUG_LOG("DATA_LENGTH_UPDATE_REQUEST"); break;
         case BLE_GAP_EVT_DATA_LENGTH_UPDATE:         DEBUG_LOG("DATA_LENGTH_UPDATE");         break;
    }


    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);

			if(appAdvGetPrevConn())
            {
                DEBUG_LOG("CON: true");
                break;
            }
            DEBUG_LOG("CON: false");
            /******app processing*****************/
            appAdvSetRealState(false);
            appConnectSetState(CONNECTION_CONNECT, m_conn_handle);
            appAdvProcessing(ADV_EVT_CONNECT,0);
            /*************************************/
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            DEBUG_LOG("Disconnected");
            /******app processing*****************/
            appAdvSetPrevConn(false);
            appConnectSetState(CONNECTION_DISCONNECT, BLE_CONN_HANDLE_INVALID);
            /*************************************/

            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}



/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

	switch(p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:         DEBUG_LOG("PM_EVT_BONDED_PEER_CONNECTED");         break;
        case PM_EVT_CONN_SEC_START:                DEBUG_LOG("PM_EVT_CONN_SEC_START");                break;
        case PM_EVT_CONN_SEC_SUCCEEDED:            DEBUG_LOG("PM_EVT_CONN_SEC_SUCCEEDED");            break;
        case PM_EVT_CONN_SEC_FAILED:               DEBUG_LOG("PM_EVT_CONN_SEC_FAILED");               break;
        case PM_EVT_CONN_SEC_CONFIG_REQ:           DEBUG_LOG("PM_EVT_CONN_SEC_CONFIG_REQ");           break;
        case PM_EVT_CONN_SEC_PARAMS_REQ:           DEBUG_LOG("PM_EVT_CONN_SEC_PARAMS_REQ");           break;
        case PM_EVT_STORAGE_FULL:                  DEBUG_LOG("PM_EVT_STORAGE_FULL");                  break;
        case PM_EVT_ERROR_UNEXPECTED:              DEBUG_LOG("PM_EVT_ERROR_UNEXPECTED");              break;
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:    DEBUG_LOG("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED");    break;
        case PM_EVT_PEER_DATA_UPDATE_FAILED:       DEBUG_LOG("PM_EVT_PEER_DATA_UPDATE_FAILED");       break;
        case PM_EVT_PEER_DELETE_SUCCEEDED:         DEBUG_LOG("PM_EVT_PEER_DELETE_SUCCEEDED");         break;
        case PM_EVT_PEER_DELETE_FAILED:            DEBUG_LOG("PM_EVT_PEER_DELETE_FAILED");            break;
        case PM_EVT_PEERS_DELETE_SUCCEEDED:        DEBUG_LOG("PM_EVT_PEERS_DELETE_SUCCEEDED");        break;
        case PM_EVT_PEERS_DELETE_FAILED:           DEBUG_LOG("PM_EVT_PEERS_DELETE_FAILED");           break;
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:        DEBUG_LOG("PM_EVT_LOCAL_DB_CACHE_APPLIED");        break;
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:   DEBUG_LOG("PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED");   break;
        case PM_EVT_SERVICE_CHANGED_IND_SENT:      DEBUG_LOG("PM_EVT_SERVICE_CHANGED_IND_SENT");      break;
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED: DEBUG_LOG("PM_EVT_SERVICE_CHANGED_IND_CONFIRMED"); break;
        case PM_EVT_SLAVE_SECURITY_REQ:            DEBUG_LOG("PM_EVT_SLAVE_SECURITY_REQ");            break;
        default: break;
    }


    switch (p_evt->evt_id)
    {

